////////////////////////////////////////////////////////////////////////////////////////////////////////////
// библиотека patcher_x86.dll 
// распространяется свободно(бесплатно)
// авторское право: Баринов Александр (baratorch), e-mail: baratorch@yandex.ru
// форма реализации низкоуровневых хуков (LoHook) отчасти позаимствована у Berserker (из ERA)
// ENG
// library patcher_x86.dll 
// distributed free of charge
// author: Barinov Alexander (baratorch), e-mail: baratorch@yandex.ru
// the design of low-level hooks (LoHook) partially got from Berserker's ERA
////////////////////////////////////////////////////////////////////////////////////////////////////////////

// версия 4.2
// ENG
// version 4.2

////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// ОПИСАНИЕ.
//
// ! библиотека предоставляет:
//  - удобные унифицированные централизованные 
//    инструменты для установки патчей и хуков
//    в код целевой программы.
//  - дополнительные инструменты: дизассемблер длин опкодов и функцию
//    копирующую код с корректным переносом опкодов jmp и call c 
//    относительной адресацией
// ! библиотека позволяет
//  - устанавливать как простые так и сложные патчи.
//  - устанавливать высокоуровневые хуки, замещая оригинальные функции в
//    в целевом коде на свои, не заботясь о регистрах процессора,
//    стеке, и возврате в оригинальный код.
//  - устанавливать высокоуровневые хуки один на другой

 ((return_type (call_type *)(_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_))(address))((_dword_)(a1),(_dword_)(a2),(_dword_)(a3),(_dword_)(a4),(_dword_)(a5),(_dword_)(a6),(_dword_)(a7),(_dword_)(a8),(_dword_)(a9),(_dword_)(a10),(_dword_)(a11),(_dword_)(a12),(_dword_)(a13),(_dword_)(a14))
#define CALL_15(return_type, call_type, address, a1, a2, a3, a4, a5, a6, a7, a8, a9, a10, a11, a12, a13, a14, a15) \
 ((return_type (call_type *)(_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_))(address))((_dword_)(a1),(_dword_)(a2),(_dword_)(a3),(_dword_)(a4),(_dword_)(a5),(_dword_)(a6),(_dword_)(a7),(_dword_)(a8),(_dword_)(a9),(_dword_)(a10),(_dword_)(a11),(_dword_)(a12),(_dword_)(a13),(_dword_)(a14),(_dword_)(a15))
#define CALL_16(return_type, call_type, address, a1, a2, a3, a4, a5, a6, a7, a8, a9, a10, a11, a12, a13, a14, a15, a16) \
 ((return_type (call_type *)(_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_))(address))((_dword_)(a1),(_dword_)(a2),(_dword_)(a3),(_dword_)(a4),(_dword_)(a5),(_dword_)(a6),(_dword_)(a7),(_dword_)(a8),(_dword_)(a9),(_dword_)(a10),(_dword_)(a11),(_dword_)(a12),(_dword_)(a13),(_dword_)(a14),(_dword_)(a15),(_dword_)(a16))
#define CALL_17(return_type, call_type, address, a1, a2, a3, a4, a5, a6, a7, a8, a9, a10, a11, a12, a13, a14, a15, a16, a17) \
 ((return_type (call_type *)(_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_))(address))((_dword_)(a1),(_dword_)(a2),(_dword_)(a3),(_dword_)(a4),(_dword_)(a5),(_dword_)(a6),(_dword_)(a7),(_dword_)(a8),(_dword_)(a9),(_dword_)(a10),(_dword_)(a11),(_dword_)(a12),(_dword_)(a13),(_dword_)(a14),(_dword_)(a15),(_dword_)(a16),(_dword_)(a17))

#define CALL_VA(return_type, adress, a1, ...) \
 ((return_type (__cdecl *)(_dword_, ...))(adress))((_dword_)(a1), __VA_ARGS__)


// _bool_ - 4-х байтовый логический тип, как BOOL в Win32 API
// если очень захочется, можно заменить на BOOL или однобайтовый bool например
// ENG
// _bool_ - 4-byte boolean type, as BOOL in Win32 API
// if you want this much you may replace it for example with BOOL or 1-byte bool
#define _bool_ __int32

// все адреса и часть указателей определены этим типом,
// если вам удобнее по-другому, можете заменить _ptr_ на любой другой тип, void* или int например
// ENG
// all addresses and the part of pointers are defined with this type,
// if another way is more convenient for you, you may replace _ptr_ with any other type, for example void* or int
typedef _dword_ _ptr_;



// во всех структурах и интерфейсах библиотеки должно быть выравнивание - 4 байта
// ENG
// all the structures of library interface must have 4-byte alignment
#pragma pack(push, 4)


//тип "переменная", используется для возвращаемых методами Patcher::VarInit и Patcher::VarFind значений.
// ENG
//"variable" type, it is used for values which are returned by Patcher::VarInit and Patcher::VarFind methods.
class Variable
{
public:
	// возвращает значение 'переменной' (потокобезопасное обращение)
	// ENG
	// returns the value of 'variable' (thread-safe reference)
	virtual _dword_ __stdcall GetValue() = 0;
	// устанавливает значение 'переменной' (потокобезопасное обращение)
	// ENG
	// sets the value of 'variable' (thread-safe reference)
	virtual void __stdcall SetValue(_dword_ value) = 0;
	// возвращает указатель на значение (обращение к значению через указатель непотокобезопасно)
	// ENG
	// returns a pointer to the value (reference to the value via this pointer is not thread-safe)
	virtual _dword_* __stdcall GetPValue() = 0;
};

// тип 'регистр флагов', размер - 32 бита 
// используется в HookContext
// ENG
// 'flag register' type, size is 32 bits
// it is used it HookContext
struct FlagsRegister
{
	_dword_ CF : 1; //0
	_dword_ reserved_1 : 1; //1
	_dword_ PF : 1; //2
	_dword_ reserved_3 : 1; //3
	_dword_ AF : 1; //4
	_dword_ reserved_5 : 1; //5
	_dword_ ZF : 1; //6
	_dword_ SF : 1; //7
	_dword_ TF : 1; //8
	_dword_ IF : 1; //9
	_dword_ DF : 1; //10
	_dword_ OF : 1; //11
	_dword_ IOPL : 2; //12-13
	_dword_ NT : 1; //14
	_dword_ reserved_15 : 1; //15
	_dword_ RF : 1; //16
	_dword_ VM : 1; //17
	_dword_ AC : 1; //18
	_dword_ VIF : 1; //19
	_dword_ VIP : 1; //20
	_dword_ ID : 1; //21
	_dword_ reserved_22 : 1; //22
	_dword_ reserved_23 : 1; //23
	_dword_ reserved_24 : 1; //24
	_dword_ reserved_25 : 1; //25
	_dword_ reserved_26 : 1; //26
	_dword_ reserved_27 : 1; //27
	_dword_ reserved_28 : 1; //28
	_dword_ reserved_29 : 1; //29
	_dword_ reserved_30 : 1; //30
	_dword_ reserved_31 : 1; //31
};

// Структура HookContext
// используется в функциях сработавших по LoHook хуку
// ENG
// HookContext structure
// it is used in functions triggered by LoHook hook
struct HookContext
{
	int eax; //регистр EAX, чтение/изменение; ENG: EAX register, read/modify
	int ecx; //регистр ECX, чтение/изменение; ENG: ECX register, read/modify
	int edx; //регистр EDX, чтение/изменение; ENG: EDX register, read/modify
	int ebx; //регистр EBX, чтение/изменение; ENG: EBX register, read/modify
	int esp; //регистр ESP, чтение/изменение; ENG: ESP register, read/modify
	int ebp; //регистр EBP, чтение/изменение; ENG: EBP register, read/modify
	int esi; //регистр ESI, чтение/изменение; ENG: ESI register, read/modify
	int edi; //регистр EDI, чтение/изменение; ENG: EDI register, read/modify

	_ptr_ return_address; //адрес возврата, чтение/изменение; ENG: return address, read/modify

	FlagsRegister flags; //регистр флагов, чтение/изменение; ENG: flag register, read/modify
